In [2]:
import pandas as pd

In [5]:
orders = pd.read_table("http://bit.ly/chiporders")

In [16]:
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [19]:
user_cols = ['userid', 'age', 'gender', 'occupation', 'zipcode']
users = pd.read_table("http://bit.ly/movieusers", sep='|', header=None, names=user_cols)

In [20]:
users.head(2)

   userid  age gender  occupation zipcode
0       1   24      M  technician   85711
1       2   53      F       other   94043

In [21]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
userid        943 non-null int64
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zipcode       943 non-null object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB